In [21]:
import sqlalchemy
from sqlalchemy import create_engine
db_string = "postgresql://wbauer_adb:adb2020@pgsql-196447.vipserv.org:5432/wbauer_adb"

db = create_engine(db_string)
connection_sqlalchemy = db.connect()

In [22]:
import psycopg2 as pg
import pandas as pd

connection = pg.connect(host='pgsql-196447.vipserv.org', port=5432, dbname='wbauer_adb', user='wbauer_adb', password='adb2020')

# Realizacja ćwiczenia
Ile kategorii filmów mamy w wypożyczalni?

In [23]:
q = """
    SELECT
        count(category_id)
    FROM
        category;
"""

df = pd.read_sql(q, con=connection_sqlalchemy)
df

   count
0     16

Wyświetl listę kategorii w kolejności alfabetycznej.

In [24]:
q = """
    SELECT
        *
    FROM
        category
    ORDER BY
        name

"""

df = pd.read_sql(q, con=connection_sqlalchemy)
df

    category_id         name         last_update
0             1       Action 2006-02-15 09:46:27
1             2    Animation 2006-02-15 09:46:27
2             3     Children 2006-02-15 09:46:27
3             4     Classics 2006-02-15 09:46:27
4             5       Comedy 2006-02-15 09:46:27
5             6  Documentary 2006-02-15 09:46:27
6             7        Drama 2006-02-15 09:46:27
7             8       Family 2006-02-15 09:46:27
8             9      Foreign 2006-02-15 09:46:27
9            10        Games 2006-02-15 09:46:27
10           11       Horror 2006-02-15 09:46:27
11           12        Music 2006-02-15 09:46:27
12           13          New 2006-02-15 09:46:27
13           14       Sci-Fi 2006-02-15 09:46:27
14           15       Sports 2006-02-15 09:46:27
15           16       Travel 2006-02-15 09:46:27

Znajdź najstarszy i najmłodszy film do wypożyczenia.

In [25]:
q = """
    SELECT
        title
    FROM
        film
    ORDER BY
        release_year asc
    FETCH FIRST ROW ONLY;
    
"""

df = pd.read_sql(q, con=connection_sqlalchemy)
df

             title
0  Chamber Italian

In [26]:
q = """
    SELECT
        title
    FROM
        film
    ORDER BY
        release_year desc
    FETCH FIRST ROW ONLY;
    
"""

df = pd.read_sql(q, con=connection_sqlalchemy)
df

             title
0  Chamber Italian

Ile wypożyczeń odbyło się między 2005-07-01 a 2005-08-01?

In [27]:
q = """
    SELECT
        count(rental_id)
    FROM
        rental
    WHERE
        rental_date BETWEEN '2005-07-01 00:00:00' AND '2005-08-01 23:59:59'
"""

df = pd.read_sql(q, con=connection_sqlalchemy)
df

   count
0   7380

Ile wypożyczeń odbyło się między 2010-01-01 a 2011-02-01?

In [28]:
q = """
    SELECT
        count(rental_id)
    FROM
        rental
    WHERE
        rental_date BETWEEN '2010-01-01 00:00:00' AND '2011-02-01 23:59:59'
"""

df = pd.read_sql(q, con=connection_sqlalchemy)
df

   count
0      0

Znajdź największą płatność wypożyczenia.

In [29]:
q = """
    SELECT
        *
    FROM
        payment
    ORDER BY
        amount desc
    FETCH FIRST ROW ONLY
"""

df = pd.read_sql(q, con=connection_sqlalchemy)
df

,payment_id,customer_id,staff_id,rental_id,amount,payment_date
0,20403,362,1,14759,11.99,2007-03-21 21:57:24.996577

Znajdź wszystkich klientów z Polski, Nigerii lub Bangladeszu.

In [30]:
q = """
    SELECT
        customer_id, first_name, last_name, country
    FROM
        customer
    INNER JOIN address
        ON customer.address_id = address.address_id
    INNER JOIN city
        ON address.city_id = city.city_id
    INNER JOIN country
        ON city.country_id = country.country_id
    WHERE 
        country IN ('Poland', 'Bangladesh', 'Nigeria')


"""

    
df = pd.read_sql(q, con=connection_sqlalchemy)
df

    customer_id first_name  last_name     country
0           284      Sonia    Gregory     Nigeria
1           318      Brian      Wyman      Poland
2           572     Sidney   Burleson      Poland
3           409     Rodney    Moeller     Nigeria
4           332    Stephen     Qualls  Bangladesh
5           286      Velma      Lucas     Nigeria
6            80    Marilyn       Ross     Nigeria
7           198      Elsie     Kelley     Nigeria
8           103     Gladys   Hamilton     Nigeria
9           329      Frank   Waggoner  Bangladesh
10          128   Marjorie     Tucker      Poland
11           18      Carol     Garcia     Nigeria
12          270       Leah     Curtis      Poland
13          501      Ruben      Geary      Poland
14          277       Olga    Jimenez     Nigeria
15          156     Bertha   Ferguson     Nigeria
16          280     Tracey    Barrett     Nigeria
17          250         Jo     Fowler     Nigeria
18          571    Johnnie   Chisholm      Poland
19          562    Wallace      Slone     Nigeria
20           21   Michelle      Clark  Bangladesh
21          380    Russell    Brinson      Poland
22          558     Jimmie  Eggleston      Poland
23          232  Constance       Reid     Nigeria

Gdzie mieszkają członkowie personelu?

In [31]:
q = """
    SELECT
        first_name, last_name, address, address2, district, city, postal_code, country
    FROM
        staff
    INNER JOIN address
        ON staff.address_id = address.address_id
    INNER JOIN city
        ON address.city_id = city.city_id
    INNER JOIN country
        ON city.country_id = country.country_id
"""

    
df = pd.read_sql(q, con=connection_sqlalchemy)
df

,first_name,last_name,address,address2,district,city,postal_code,country
0,Mike,Hillyer,23 Workhaven Lane,None,Alberta,Lethbridge,,Canada
1,Jon,Stephens,1411 Lillydale Drive,None,QLD,Woodridge,,Australia

Ilu pracowników mieszka w Argentynie lub Hiszpanii?

In [32]:
q = """
    SELECT
        count(staff_id)
    FROM
        staff
    INNER JOIN address
        ON staff.address_id = address.address_id
    INNER JOIN city
        ON address.city_id = city.city_id
    INNER JOIN country
        ON city.country_id = country.country_id
    WHERE 
        country IN ('Argentina', 'Spain')
"""

    
df = pd.read_sql(q, con=connection_sqlalchemy)
df

   count
0      0

Jakie kategorie filmów zostały wypożyczone przez klientów?

In [33]:
q = """
    SELECT
        DISTINCT name
    FROM
        rental
    INNER JOIN inventory
        ON rental.inventory_id = inventory.inventory_id
    INNER JOIN film
        ON inventory.film_id = film.film_id
    INNER JOIN film_category
        ON film_category.film_id= film.film_id
    INNER JOIN category
        ON film_category.category_id = category.category_id

    
"""

    
df = pd.read_sql(q, con=connection_sqlalchemy)
df

           name
0        Sports
1      Classics
2           New
3        Family
4        Comedy
5     Animation
6        Travel
7         Music
8         Drama
9        Horror
10       Sci-Fi
11        Games
12  Documentary
13      Foreign
14       Action
15     Children

Znajdź wszystkie kategorie filmów wypożyczonych w Ameryce.

In [34]:
q = """
    SELECT
        DISTINCT name
    FROM
        rental
    INNER JOIN inventory
        ON rental.inventory_id = inventory.inventory_id
    INNER JOIN film
        ON inventory.film_id = film.film_id
    INNER JOIN film_category
        ON film_category.film_id= film.film_id
    INNER JOIN category
        ON film_category.category_id = category.category_id

    INNER JOIN customer
        ON rental.customer_id = customer.customer_id
    INNER JOIN address
        ON customer.address_id = address.address_id
    INNER JOIN city
        ON address.city_id = city.city_id
    INNER JOIN country
        ON city.country_id = country.country_id
    WHERE 
        country IN ('United States')
"""

    
df = pd.read_sql(q, con=connection_sqlalchemy)
df

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

Znajdź wszystkie tytuły filmów, w których grał: Olympia Pfeiffer lub Julia Zellweger lub Ellen Presley

In [35]:
q = """
    SELECT
        title
    FROM
        film
    INNER JOIN film_actor
        ON film.film_id = film_actor.film_id
    INNER JOIN actor
        ON film_actor.actor_id = actor.actor_id
    WHERE 
        (actor.first_name = 'Olympia' AND actor.last_name = 'Pfeiffer') OR
        (actor.first_name = 'Julia' AND actor.last_name = 'Zellweger') OR
        (actor.first_name = 'Ellen' AND actor.last_name = 'Presley')
    ORDER BY
        title
"""

    
df = pd.read_sql(q, con=connection_sqlalchemy)
df

                   title
0            Badman Dawn
1        Bilko Anonymous
2   Breakfast Goldfinger
3      Caribbean Liberty
4       Casper Dragonfly
..                   ...
64             Turn Star
65            Wait Cider
66          Women Dorado
67             Won Dares
68         Wyoming Storm

[69 rows x 1 columns]